maanavkoladia/IoTRobotCar/sw/src_TM4C/startup_gcc.c
void BusFault_Handler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

void UsageFault_Handler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

void SVC_Handler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

void DebugMon_Handler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

void PendSV_Handler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

void SysTick_Handler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************

void IntDefaultHandler(void){
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//calls the default handler if the ISR is undefined
//*****************************************************************************

void GPIOPortA_Handler(void){
    IntDefaultHandler();
}

void GPIOPortB_Handler(void){
    IntDefaultHandler();
}

void GPIOPortC_Handler(void){
    IntDefaultHandler();
}

void GPIOPortD_Handler(void){
    IntDefaultHandler();
}

void GPIOPortE_Handler(void){
    IntDefaultHandler();
}

void UART0_Handler(void){
    IntDefaultHandler();
}

void UART1_Handler(void){
    IntDefaultHandler();
}

void SSI0_Handler(void){
    IntDefaultHandler();
}

void I2C0_Handler(void){
    IntDefaultHandler();
}

void PWM0Fault_Handler(void){
    IntDefaultHandler();
}

void PWM0Generator0_Handler(void){
    IntDefaultHandler();
}

void PWM0Generator1_Handler(void){
    IntDefaultHandler();
}

void PWM0Generator2_Handler(void){
    IntDefaultHandler();
}

void Quadrature0_Handler(void){
    IntDefaultHandler();
}

void ADC0Seq0_Handler(void){
    IntDefaultHandler();
}

void ADC0Seq1_Handler(void){
    IntDefaultHandler();
}

void ADC0Seq2_Handler(void){
    IntDefaultHandler();
}

void ADC0Seq3_Handler(void){
    IntDefaultHandler();
}

void WDT_Handler(void){
    IntDefaultHandler();
}

void Timer0A_Handler(void){
    IntDefaultHandler();
}

void Timer0B_Handler(void){
    IntDefaultHandler();
}

void Timer1A_Handler(void){
    IntDefaultHandler();
}

void Timer1B_Handler(void){
    IntDefaultHandler();
}

void Timer2A_Handler(void){
    IntDefaultHandler();
}

void Timer2B_Handler(void){
    IntDefaultHandler();
}

void Comp0_Handler(void){
    IntDefaultHandler();
}

void Comp1_Handler(void){
    IntDefaultHandler();
}

void Comp2_Handler(void){
    IntDefaultHandler();
}

void SysCtl_Handler(void){
    IntDefaultHandler();
}

void FlashCtl_Handler(void){
    IntDefaultHandler();
}

void GPIOPortF_Handler(void){
    IntDefaultHandler();
}

void GPIOPortG_Handler(void){
    IntDefaultHandler();
}

void GPIOPortH_Handler(void){
    IntDefaultHandler();
}

void UART2_Handler(void){
    IntDefaultHandler();
}

void SSI1_Handler(void){
    IntDefaultHandler();
}

void Timer3A_Handler(void){
    IntDefaultHandler();
}

void Timer3B_Handler(void){
    IntDefaultHandler();
}

void I2C1_Handler(void){
    IntDefaultHandler();
}

void Quadrature1_Handler(void){
    IntDefaultHandler();
}

void CAN0_Handler(void){
    IntDefaultHandler();
}

void CAN1_Handler(void){
    IntDefaultHandler();
}

void CAN2_Handler(void){
    IntDefaultHandler();
}

void Ethernet_Handler(void){
    IntDefaultHandler();
}

void Hibernate_Handler(void){
    IntDefaultHandler();
}

void USB0_Handler(void){
    IntDefaultHandler();
}

void PWM0Generator3_Handler(void){
    IntDefaultHandler();
}

void uDMA_Handler(void){
    IntDefaultHandler();
}

void uDMA_Error(void){
    IntDefaultHandler();
}

void ADC1Seq0_Handler(void){
    IntDefaultHandler();
}

void ADC1Seq1_Handler(void){
    IntDefaultHandler();
}

void ADC1Seq2_Handler(void){
    IntDefaultHandler();
}

void ADC1Seq3_Handler(void){
    IntDefaultHandler();
}

void I2S0_Handler(void){
    IntDefaultHandler();
}

void ExtBus_Handler(void){
    IntDefaultHandler();
}

void GPIOPortJ_Handler(void){
    IntDefaultHandler();
}

void GPIOPortK_Handler(void){
    IntDefaultHandler();
}

void GPIOPortL_Handler(void){
    IntDefaultHandler();
}

void SSI2_Handler(void){
    IntDefaultHandler();
}

void SSI3_Handler(void){
    IntDefaultHandler();
}

void UART3_Handler(void){
    IntDefaultHandler();
}

void UART4_Handler(void){
    IntDefaultHandler();
}

void UART5_Handler(void){
    IntDefaultHandler();
}

void UART6_Handler(void){
    IntDefaultHandler();
}

void UART7_Handler(void){
    IntDefaultHandler();
}

void I2C2_Handler(void){
    IntDefaultHandler();
}

void I2C3_Handler(void){
    IntDefaultHandler();
}

void Timer4A_Handler(void){
    IntDefaultHandler();
}

void Timer4B_Handler(void){
    IntDefaultHandler();
}

void Timer5A_Handler(void){
    IntDefaultHandler();
}

void Timer5B_Handler(void){
    IntDefaultHandler();
}

void WideTimer0A_Handler(void){
    IntDefaultHandler();
}

void WideTimer0B_Handler(void){
    IntDefaultHandler();
}

void WideTimer1A_Handler(void){
    IntDefaultHandler();
}

void WideTimer1B_Handler(void){
    IntDefaultHandler();
}

void WideTimer2A_Handler(void){
    IntDefaultHandler();
}

void WideTimer2B_Handler(void){
    IntDefaultHandler();
}

void WideTimer3A_Handler(void){
    IntDefaultHandler();
}

void WideTimer3B_Handler(void){
    IntDefaultHandler();
}

