maanavkoladia/IoTRobotCar/sw/src_TM4C/startup_gcc.c
void WideTimer4A_Handler(void){
    IntDefaultHandler();
}

void WideTimer4B_Handler(void){
    IntDefaultHandler();
}

void WideTimer5A_Handler(void){
    IntDefaultHandler();
}

void WideTimer5B_Handler(void){
    IntDefaultHandler();
}

void FPU_Handler(void){
    IntDefaultHandler();
}

void PECI0_Handler(void){
    IntDefaultHandler();
}

void LPC0_Handler(void){
    IntDefaultHandler();
}

void I2C4_Handler(void){
    IntDefaultHandler();
}

void I2C5_Handler(void){
    IntDefaultHandler();
}

void GPIOPortM_Handler(void){
    IntDefaultHandler();
}

void GPIOPortN_Handler(void){
    IntDefaultHandler();
}

void Quadrature2_Handler(void){
    IntDefaultHandler();
}

void Fan0_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP1_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP2_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP3_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP4_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP5_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP6_Handler(void){
    IntDefaultHandler();
}

void GPIOPortP7_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ1_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ2_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ3_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ4_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ5_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ6_Handler(void){
    IntDefaultHandler();
}

void GPIOPortQ7_Handler(void){
    IntDefaultHandler();
}

void GPIOPortR_Handler(void){
    IntDefaultHandler();
}

void GPIOPortS_Handler(void){
    IntDefaultHandler();
}

void PWM1Generator0_Handler(void){
    IntDefaultHandler();
}

void PWM1Generator1_Handler(void){
    IntDefaultHandler();
}

void PWM1Generator2_Handler(void){
    IntDefaultHandler();
}

void PWM1Generator3_Handler(void){
    IntDefaultHandler();
}

void PWM1Fault_Handler(void){
    IntDefaultHandler();
}

//*****************************************************************************
//these are the funcitons that DR.Valvano gave us in his startup.s file for keil
//*****************************************************************************
// Disable interrupts
void DisableInterrupts(void) {
    __asm volatile ("CPSID I" : : : "memory");
}

// Enable interrupts
void EnableInterrupts(void) {
    __asm volatile ("CPSIE I" : : : "memory");
}

// Make a copy of the current interrupt state and disable interrupts
uint32_t StartCritical(void) {
    uint32_t primask;
    __asm volatile ("MRS %0, PRIMASK" : "=r" (primask) :: "memory");
    __asm volatile ("CPSID I" : : : "memory");
    return primask;
}

// Restore the previous interrupt state using the copy of PRIMASK
void EndCritical(uint32_t primask) {
    __asm volatile ("MSR PRIMASK, %0" : : "r" (primask) : "memory");
}

// Wait for an interrupt (put the processor in low power mode)
void WaitForInterrupt(void) {
    __asm volatile ("WFI" : : : "memory");
}

//*****************************************************************************
//these are ISR handlers
//*****************************************************************************
